In [17]:
import pandas as pd

In [18]:
df = pd.read_csv('student_dataset.csv')

In [19]:
df.head()

   ID       Name  Age  Marks  Gender
0   1  Student_1   24     94    Male
1   2  Student_2   21     81  Female
2   3  Student_3   22     90    Male
3   4  Student_4   24     56  Female
4   5  Student_5   20     44  Female

In [20]:
df.tail()

       ID          Name  Age  Marks  Gender
995   996   Student_996   23     82  Female
996   997   Student_997   18     73  Female
997   998   Student_998   24     96  Female
998   999   Student_999   21     65    Male
999  1000  Student_1000   23     80    Male

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      1000 non-null   int64
 1   Name    1000 non-null   object
 2   Age     1000 non-null   int64
 3   Marks   1000 non-null   int64
 4   Gender  1000 non-null   object
dtypes: int64(3), object(2)
memory usage: 39.2+ KB

In [ ]:
# Average Marks
df['Marks'].mean()

70.232

In [ ]:
# Marks Mode
df['Marks'].mode()

0    65
Name: Marks, dtype: int64

In [ ]:
# Marks Median
df['Marks'].median()

70.0

In [25]:
# Standard Deviation of Marks
df['Marks'].std()

17.46863845093053

In [26]:
# Minimum Marks
df['Marks'].min()

40

In [27]:
# Maximum Marks
df['Marks'].max()

100

In [28]:
# Average Age
df['Age'].mean()

20.96

In [29]:
# Age Median
df['Age'].median()

21.0

In [30]:
# Age Mode
df['Age'].mode()

0    18
1    21
Name: Age, dtype: int64

In [31]:
# Standard Deviation of Age
df['Age'].std()

2.0036003629502583

In [32]:
# Minimum Age
df['Age'].min()

18

In [33]:
# Maximum Age
df['Age'].max()

24